openfoam/tutorials/channelflow300_st25/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 		0 		0)
    (0.16 	0 		0)
    (0.16 	0.08 	0)
    (0 		0.08 	0)
    (0 		0 		0.04)
    (0.16 	0 		0.04)
    (0.16 	0.08 	0.04)
    (0 		0.08 	0.04)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (22 22 33) 
	simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottomWall
    {
        type            wall;
        faces           ((0 1 2 3));
    }
    topWall
    {
        type            wall;
        faces           ((4 5 6 7));
    }

    side0
    {
        type            cyclic;
	neighbourPatch 	side1;
        faces           ((1 0 4 5));
    }
    side1
    {
        type            cyclic;
	neighbourPatch 	side0;
        faces           ((3 2 6 7));
    }


    in
    {
        type            cyclic;
        neighbourPatch  out;
        faces           ((3 0 4 7));
    }

    out
    {
        type            cyclic;
        neighbourPatch  in;
        faces           ((2 1 5 6));
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
