openfoam/tutorials/channelflow300_st25/constant/turbulenceProperties.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType LES;

LES
{
    LESModel        WALE;

    turbulence 	on;
    printCoeffs     on;

    delta           cubeRootVol;

    dynamicSmagorinskyDevCoeffs
    {
        filter    simple;
        ce        1;
    }


    dynamicKEqnDevCoeffs
    {
        filter simple;
    }

    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }

    maxDeltaxyzCoeffs
    {
        deltaCoeff      2;
    }

    vanDriestCoeffs
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }

        Aplus           26;
        Cdelta          0.158;
    }

}



// ************************************************************************* //
