openfoam/tutorials/channelflow300_st25/constant/kinematicHWCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      particleProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection off;

    interpolationSchemes
    {

        rho.air         cell;
        mu.air          cell;
        U.air           cell;
    }

    averagingMethod dual;

    integrationSchemes
    {
        U               analytical;
    }

    sourceTerms
    {
        schemes
        {
            U semiImplicit 1;
        }
    }
}

constantProperties
{
    rho0            1000;

    alphaMax        0.9;
}

subModels
{
    particleForces
    {
        StokesDrag //BeetstraDrag //UsDrag ///WenYuDrag
        {
            alphac alpha.air;
        }
    }

    injectionModels
    {
        model1
        {
            type            manualInjection;
            massTotal       0;
            parcelBasisType fixed;
            nParticle       1;
            SOI             0;//.02;
            positionsFile   "injectionTable.dat"; //"kinematicCloudPositions";
            U0              (0 0 0);
            sizeDistribution
            {
                type        fixedValue;
                fixedValueDistribution
                {
                    value  50.9e-6;
                }
            }
        }
    }

    dispersionModel "dispersionAverageFieldsOnly";
    DispersionAverageFieldsOnlyCoeffs
    {
        U                   U.air;
        init                "Uc";
        fillEmptyCells      true;
    }

    patchInteractionModel rebound;

    reboundCoeffs
    {
        UFactor             1.0;
    }

    heatTransferModel none;

    surfaceFilmModel none;

    packingModel none;

    dampingModel none; 

    isotropyModel none; 
    
    stochasticCollisionModel none;

    radiation off;
}

cloudFunctions
{}


// ************************************************************************* //
