openfoam/tutorials/channelflow300_st25/0/U.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
125840
(
(0.0395696 0.00248735 -0.000171231)
(0.0518311 -0.0103601 -1.3444e-05)
(0.0579291 -0.004006 3.89851e-05)
(0.0627241 -0.000383693 -0.000144057)
(0.0677698 -0.0113477 -0.000174754)
(0.0635361 -0.0171427 8.55178e-05)
(0.0634467 -0.013144 0.000188826)
(0.0741635 -0.00142168 -3.20808e-07)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    side0
    {
        type            cyclic;
    }
    side1
    {
        type            cyclic;
    }
    in
    {
        type            cyclic;
    }
    out
    {
        type            cyclic;
    }
}


// ************************************************************************* //
