openfoam/tutorials/channelflow300_st25/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
125840
(
-0.0086182
-0.00257265
-0.0767466
-0.106142
-0.0721448
-0.137661
-0.136817
-0.0670162
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
1936
(
-0.0086182
-0.115358
-0.0675207
-0.0110402
-0.101596
-0.136563
-0.169052
-0.130034
...
)
;
    }
    topWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
1936
(
-0.239309
-0.11533
-0.0118481
-0.0474893
-0.143112
-0.0952483
-0.0640426
-0.101709
...
)
;
    }
    side0
    {
        type            cyclic;
    }
    side1
    {
        type            cyclic;
    }
    in
    {
        type            cyclic;
    }
    out
    {
        type            cyclic;
    }
}


// ************************************************************************* //
