openfoam/tutorials/channelflow300_st25/0/Cs.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cs.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
125840
(
-3.3015e-07
7.11168e-07
-1.4963e-06
5.68971e-08
4.86982e-06
3.53175e-06
-1.76615e-06
-1.05752e-07
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1936
(
-2.99341e+19
-2.45435e+19
3.83593e+18
2.73205e+19
8.56279e+18
-2.90759e+19
1.02891e+19
-1.859e+18
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1936
(
5.77996e+18
1.93745e+18
-1.94846e+19
-1.305e+19
-2.07511e+19
-2.00224e+19
3.1046e+18
-8.80004e+18
...
)
;
    }
    side0
    {
        type            cyclic;
    }
    side1
    {
        type            cyclic;
    }
    in
    {
        type            cyclic;
    }
    out
    {
        type            cyclic;
    }
}


// ************************************************************************* //
