openfoam/tutorials/channelflow300_st25/0/alpha.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "4.2e-05";
    object      alpha.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
125840
(
0.999590109457352161
0.999590110020387446
1
0.999795054727548815
1
1
0.999590110024332623
0.999590109455097742
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1936
(
0.999590109457352161
1
0.999795055292274193
0.999385164184337427
0.99918021891470421
0.999795054728112476
0.999385164182646557
0.999590109455097742
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1936
(
1
0.999590127484100699
0.999180259476778687
0.999795063742050294
0.999590127484100699
0.999795063742050294
0.999795063742050294
0.999795063742050294
...
)
;
    }
    side0
    {
        type            cyclic;
    }
    side1
    {
        type            cyclic;
    }
    in
    {
        type            cyclic;
    }
    out
    {
        type            cyclic;
    }
}


// ************************************************************************* //
