openfoam/tutorials/channelflow300_st25/0/k.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
125840
(
0.000386858
0.000692578
0.00083157
0.000973424
0.00114115
0.00101376
0.00100453
0.00132935
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform 0;
    }
    topWall
    {
        type            fixedValue;
        value           uniform 0;
    }
    side0
    {
        type            cyclic;
    }
    side1
    {
        type            cyclic;
    }
    in
    {
        type            cyclic;
    }
    out
    {
        type            cyclic;
    }
}


// ************************************************************************* //
